GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 039DEh
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h
OSCTUNE_HFTUN_POSN                       equ 0000h
OSCTUNE_HFTUN_POSITION                   equ 0000h
OSCTUNE_HFTUN_SIZE                       equ 0006h
OSCTUNE_HFTUN_LENGTH                     equ 0006h
OSCTUNE_HFTUN_MASK                       equ 003Fh
OSCTUNE_HFTUN0_POSN                      equ 0000h
OSCTUNE_HFTUN0_POSITION                  equ 0000h
OSCTUNE_HFTUN0_SIZE                      equ 0001h
OSCTUNE_HFTUN0_LENGTH                    equ 0001h
OSCTUNE_HFTUN0_MASK                      equ 0001h
OSCTUNE_HFTUN1_POSN                      equ 0001h
OSCTUNE_HFTUN1_POSITION                  equ 0001h
OSCTUNE_HFTUN1_SIZE                      equ 0001h
OSCTUNE_HFTUN1_LENGTH                    equ 0001h
OSCTUNE_HFTUN1_MASK                      equ 0002h
OSCTUNE_HFTUN2_POSN                      equ 0002h
OSCTUNE_HFTUN2_POSITION                  equ 0002h
OSCTUNE_HFTUN2_SIZE                      equ 0001h
OSCTUNE_HFTUN2_LENGTH                    equ 0001h
OSCTUNE_HFTUN2_MASK                      equ 0004h
OSCTUNE_HFTUN3_POSN                      equ 0003h
OSCTUNE_HFTUN3_POSITION                  equ 0003h
OSCTUNE_HFTUN3_SIZE                      equ 0001h
OSCTUNE_HFTUN3_LENGTH                    equ 0001h
OSCTUNE_HFTUN3_MASK                      equ 0008h
OSCTUNE_HFTUN4_POSN                      equ 0004h
OSCTUNE_HFTUN4_POSITION                  equ 0004h
OSCTUNE_HFTUN4_SIZE                      equ 0001h
OSCTUNE_HFTUN4_LENGTH                    equ 0001h
OSCTUNE_HFTUN4_MASK                      equ 0010h
OSCTUNE_HFTUN5_POSN                      equ 0005h
OSCTUNE_HFTUN5_POSITION                  equ 0005h
OSCTUNE_HFTUN5_SIZE                      equ 0001h
OSCTUNE_HFTUN5_LENGTH                    equ 0001h
OSCTUNE_HFTUN5_MASK                      equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 039DFh
// bitfield definitions
OSCFRQ_FRQ_POSN                          equ 0000h
OSCFRQ_FRQ_POSITION                      equ 0000h
OSCFRQ_FRQ_SIZE                          equ 0004h
OSCFRQ_FRQ_LENGTH                        equ 0004h
OSCFRQ_FRQ_MASK                          equ 000Fh
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h
OSCFRQ_FRQ3_POSN                         equ 0003h
OSCFRQ_FRQ3_POSITION                     equ 0003h
OSCFRQ_FRQ3_SIZE                         equ 0001h
OSCFRQ_FRQ3_LENGTH                       equ 0001h
OSCFRQ_FRQ3_MASK                         equ 0008h
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0004h
OSCFRQ_HFFRQ_LENGTH                      equ 0004h
OSCFRQ_HFFRQ_MASK                        equ 000Fh
OSCFRQ_HFFRQ0_POSN                       equ 0000h
OSCFRQ_HFFRQ0_POSITION                   equ 0000h
OSCFRQ_HFFRQ0_SIZE                       equ 0001h
OSCFRQ_HFFRQ0_LENGTH                     equ 0001h
OSCFRQ_HFFRQ0_MASK                       equ 0001h
OSCFRQ_HFFRQ1_POSN                       equ 0001h
OSCFRQ_HFFRQ1_POSITION                   equ 0001h
OSCFRQ_HFFRQ1_SIZE                       equ 0001h
OSCFRQ_HFFRQ1_LENGTH                     equ 0001h
OSCFRQ_HFFRQ1_MASK                       equ 0002h
OSCFRQ_HFFRQ2_POSN                       equ 0002h
OSCFRQ_HFFRQ2_POSITION                   equ 0002h
OSCFRQ_HFFRQ2_SIZE                       equ 0001h
OSCFRQ_HFFRQ2_LENGTH                     equ 0001h
OSCFRQ_HFFRQ2_MASK                       equ 0004h
OSCFRQ_HFFRQ3_POSN                       equ 0003h
OSCFRQ_HFFRQ3_POSITION                   equ 0003h
OSCFRQ_HFFRQ3_SIZE                       equ 0001h
OSCFRQ_HFFRQ3_LENGTH                     equ 0001h
OSCFRQ_HFFRQ3_MASK                       equ 0008h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 039E0h
// bitfield definitions
NVMADRL_ADR_POSN                         equ 0000h
NVMADRL_ADR_POSITION                     equ 0000h
NVMADRL_ADR_SIZE                         equ 0008h
NVMADRL_ADR_LENGTH                       equ 0008h
NVMADRL_ADR_MASK                         equ 00FFh
NVMADRL_ADR0_POSN                        equ 0000h
NVMADRL_ADR0_POSITION                    equ 0000h
NVMADRL_ADR0_SIZE                        equ 0001h
NVMADRL_ADR0_LENGTH                      equ 0001h
NVMADRL_ADR0_MASK                        equ 0001h
NVMADRL_ADR1_POSN                        equ 0001h
NVMADRL_ADR1_POSITION                    equ 0001h
NVMADRL_ADR1_SIZE                        equ 0001h
NVMADRL_ADR1_LENGTH                      equ 0001h
NVMADRL_ADR1_MASK                        equ 0002h
NVMADRL_ADR2_POSN                        equ 0002h
NVMADRL_ADR2_POSITION                    equ 0002h
NVMADRL_ADR2_SIZE                        equ 0001h
NVMADRL_ADR2_LENGTH                      equ 0001h
NVMADRL_ADR2_MASK                        equ 0004h
NVMADRL_ADR3_POSN                        equ 0003h
NVMADRL_ADR3_POSITION                    equ 0003h
NVMADRL_ADR3_SIZE                        equ 0001h
NVMADRL_ADR3_LENGTH                      equ 0001h
NVMADRL_ADR3_MASK                        equ 0008h
NVMADRL_ADR4_POSN                        equ 0004h
NVMADRL_ADR4_POSITION                    equ 0004h
NVMADRL_ADR4_SIZE                        equ 0001h
NVMADRL_ADR4_LENGTH                      equ 0001h
NVMADRL_ADR4_MASK                        equ 0010h
NVMADRL_ADR5_POSN                        equ 0005h
NVMADRL_ADR5_POSITION                    equ 0005h
NVMADRL_ADR5_SIZE                        equ 0001h
NVMADRL_ADR5_LENGTH                      equ 0001h
NVMADRL_ADR5_MASK                        equ 0020h
NVMADRL_ADR6_POSN                        equ 0006h
NVMADRL_ADR6_POSITION                    equ 0006h
NVMADRL_ADR6_SIZE                        equ 0001h
NVMADRL_ADR6_LENGTH                      equ 0001h
NVMADRL_ADR6_MASK                        equ 0040h
NVMADRL_ADR7_POSN                        equ 0007h
NVMADRL_ADR7_POSITION                    equ 0007h
NVMADRL_ADR7_SIZE                        equ 0001h
NVMADRL_ADR7_LENGTH                      equ 0001h
NVMADRL_ADR7_MASK                        equ 0080h
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 039E3h
// bitfield definitions
NVMDAT_DAT_POSN                          equ 0000h
NVMDAT_DAT_POSITION                      equ 0000h
NVMDAT_DAT_SIZE                          equ 0008h
NVMDAT_DAT_LENGTH                        equ 0008h
NVMDAT_DAT_MASK                          equ 00FFh
NVMDAT_DAT0_POSN                         equ 0000h
NVMDAT_DAT0_POSITION                     equ 0000h
NVMDAT_DAT0_SIZE                         equ 0001h
NVMDAT_DAT0_LENGTH                       equ 0001h
NVMDAT_DAT0_MASK                         equ 0001h
NVMDAT_DAT1_POSN                         equ 0001h
NVMDAT_DAT1_POSITION                     equ 0001h
NVMDAT_DAT1_SIZE                         equ 0001h
NVMDAT_DAT1_LENGTH                       equ 0001h
NVMDAT_DAT1_MASK                         equ 0002h
NVMDAT_DAT2_POSN                         equ 0002h
NVMDAT_DAT2_POSITION                     equ 0002h
NVMDAT_DAT2_SIZE                         equ 0001h
NVMDAT_DAT2_LENGTH                       equ 0001h
NVMDAT_DAT2_MASK                         equ 0004h
NVMDAT_DAT3_POSN                         equ 0003h
NVMDAT_DAT3_POSITION                     equ 0003h
NVMDAT_DAT3_SIZE                         equ 0001h
NVMDAT_DAT3_LENGTH                       equ 0001h
NVMDAT_DAT3_MASK                         equ 0008h
NVMDAT_DAT4_POSN                         equ 0004h
NVMDAT_DAT4_POSITION                     equ 0004h
NVMDAT_DAT4_SIZE                         equ 0001h
NVMDAT_DAT4_LENGTH                       equ 0001h
NVMDAT_DAT4_MASK                         equ 0010h
NVMDAT_DAT5_POSN                         equ 0005h
NVMDAT_DAT5_POSITION                     equ 0005h
NVMDAT_DAT5_SIZE                         equ 0001h
NVMDAT_DAT5_LENGTH                       equ 0001h
NVMDAT_DAT5_MASK                         equ 0020h
NVMDAT_DAT6_POSN                         equ 0006h
NVMDAT_DAT6_POSITION                     equ 0006h
NVMDAT_DAT6_SIZE                         equ 0001h
NVMDAT_DAT6_LENGTH                       equ 0001h
NVMDAT_DAT6_MASK                         equ 0040h
NVMDAT_DAT7_POSN                         equ 0007h
NVMDAT_DAT7_POSITION                     equ 0007h
NVMDAT_DAT7_SIZE                         equ 0001h
NVMDAT_DAT7_LENGTH                       equ 0001h
NVMDAT_DAT7_MASK                         equ 0080h
NVMDAT_NVMDAT_POSN                       equ 0000h
NVMDAT_NVMDAT_POSITION                   equ 0000h
NVMDAT_NVMDAT_SIZE                       equ 0008h
NVMDAT_NVMDAT_LENGTH                     equ 0008h
NVMDAT_NVMDAT_MASK                       equ 00FFh
NVMDAT_NVMDAT0_POSN                      equ 0000h
NVMDAT_NVMDAT0_POSITION                  equ 0000h
NVMDAT_NVMDAT0_SIZE                      equ 0001h
NVMDAT_NVMDAT0_LENGTH                    equ 0001h
NVMDAT_NVMDAT0_MASK                      equ 0001h
NVMDAT_NVMDAT1_POSN                      equ 0001h
NVMDAT_NVMDAT1_POSITION                  equ 0001h
NVMDAT_NVMDAT1_SIZE                      equ 0001h
NVMDAT_NVMDAT1_LENGTH                    equ 0001h
NVMDAT_NVMDAT1_MASK                      equ 0002h
NVMDAT_NVMDAT2_POSN                      equ 0002h
NVMDAT_NVMDAT2_POSITION                  equ 0002h
NVMDAT_NVMDAT2_SIZE                      equ 0001h
NVMDAT_NVMDAT2_LENGTH                    equ 0001h
NVMDAT_NVMDAT2_MASK                      equ 0004h
NVMDAT_NVMDAT3_POSN                      equ 0003h
NVMDAT_NVMDAT3_POSITION                  equ 0003h
NVMDAT_NVMDAT3_SIZE                      equ 0001h
NVMDAT_NVMDAT3_LENGTH                    equ 0001h
NVMDAT_NVMDAT3_MASK                      equ 0008h
NVMDAT_NVMDAT4_POSN                      equ 0004h
NVMDAT_NVMDAT4_POSITION                  equ 0004h
NVMDAT_NVMDAT4_SIZE                      equ 0001h
NVMDAT_NVMDAT4_LENGTH                    equ 0001h
NVMDAT_NVMDAT4_MASK                      equ 0010h
NVMDAT_NVMDAT5_POSN                      equ 0005h
NVMDAT_NVMDAT5_POSITION                  equ 0005h
NVMDAT_NVMDAT5_SIZE                      equ 0001h
NVMDAT_NVMDAT5_LENGTH                    equ 0001h
NVMDAT_NVMDAT5_MASK                      equ 0020h
NVMDAT_NVMDAT6_POSN                      equ 0006h
NVMDAT_NVMDAT6_POSITION                  equ 0006h
NVMDAT_NVMDAT6_SIZE                      equ 0001h
NVMDAT_NVMDAT6_LENGTH                    equ 0001h
NVMDAT_NVMDAT6_MASK                      equ 0040h
NVMDAT_NVMDAT7_POSN                      equ 0007h
NVMDAT_NVMDAT7_POSITION                  equ 0007h
NVMDAT_NVMDAT7_SIZE                      equ 0001h
NVMDAT_NVMDAT7_LENGTH                    equ 0001h
NVMDAT_NVMDAT7_MASK                      equ 0080h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 039E5h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_REG_POSN                         equ 0006h
NVMCON1_REG_POSITION                     equ 0006h
NVMCON1_REG_SIZE                         equ 0002h
NVMCON1_REG_LENGTH                       equ 0002h
NVMCON1_REG_MASK                         equ 00C0h
NVMCON1_REG0_POSN                        equ 0006h
NVMCON1_REG0_POSITION                    equ 0006h
NVMCON1_REG0_SIZE                        equ 0001h
NVMCON1_REG0_LENGTH                      equ 0001h
NVMCON1_REG0_MASK                        equ 0040h
NVMCON1_REG1_POSN                        equ 0007h
NVMCON1_REG1_POSITION                    equ 0007h
NVMCON1_REG1_SIZE                        equ 0001h
NVMCON1_REG1_LENGTH                      equ 0001h
NVMCON1_REG1_MASK                        equ 0080h
NVMCON1_NVMREG_POSN                      equ 0006h
NVMCON1_NVMREG_POSITION                  equ 0006h
NVMCON1_NVMREG_SIZE                      equ 0002h
NVMCON1_NVMREG_LENGTH                    equ 0002h
NVMCON1_NVMREG_MASK                      equ 00C0h
NVMCON1_NVMREG0_POSN                     equ 0006h
NVMCON1_NVMREG0_POSITION                 equ 0006h
NVMCON1_NVMREG0_SIZE                     equ 0001h
NVMCON1_NVMREG0_LENGTH                   equ 0001h
NVMCON1_NVMREG0_MASK                     equ 0040h
NVMCON1_NVMREG1_POSN                     equ 0007h
NVMCON1_NVMREG1_POSITION                 equ 0007h
NVMCON1_NVMREG1_SIZE                     equ 0001h
NVMCON1_NVMREG1_LENGTH                   equ 0001h
NVMCON1_NVMREG1_MASK                     equ 0080h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 039E6h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

// Register: PRLOCK
#define PRLOCK PRLOCK
PRLOCK                                   equ 039EFh
// bitfield definitions
PRLOCK_PRLOCKED_POSN                     equ 0000h
PRLOCK_PRLOCKED_POSITION                 equ 0000h
PRLOCK_PRLOCKED_SIZE                     equ 0001h
PRLOCK_PRLOCKED_LENGTH                   equ 0001h
PRLOCK_PRLOCKED_MASK                     equ 0001h

// Register: ISRPR
#define ISRPR ISRPR
ISRPR                                    equ 039F1h
// bitfield definitions
ISRPR_PR_POSN                            equ 0000h
ISRPR_PR_POSITION                        equ 0000h
ISRPR_PR_SIZE                            equ 0003h
ISRPR_PR_LENGTH                          equ 0003h
ISRPR_PR_MASK                            equ 0007h
ISRPR_PR0_POSN                           equ 0000h
ISRPR_PR0_POSITION                       equ 0000h
ISRPR_PR0_SIZE                           equ 0001h
ISRPR_PR0_LENGTH                         equ 0001h
ISRPR_PR0_MASK                           equ 0001h
ISRPR_PR1_POSN                           equ 0001h
ISRPR_PR1_POSITION                       equ 0001h
ISRPR_PR1_SIZE                           equ 0001h
ISRPR_PR1_LENGTH                         equ 0001h
ISRPR_PR1_MASK                           equ 0002h
ISRPR_PR2_POSN                           equ 0002h
ISRPR_PR2_POSITION                       equ 0002h
ISRPR_PR2_SIZE                           equ 0001h
ISRPR_PR2_LENGTH                         equ 0001h
ISRPR_PR2_MASK                           equ 0004h
ISRPR_ISRPR_POSN                         equ 0000h
ISRPR_ISRPR_POSITION                     equ 0000h
ISRPR_ISRPR_SIZE                         equ 0003h
ISRPR_ISRPR_LENGTH                       equ 0003h
ISRPR_ISRPR_MASK                         equ 0007h
ISRPR_ISRPR0_POSN                        equ 0000h
ISRPR_ISRPR0_POSITION                    equ 0000h
ISRPR_ISRPR0_SIZE                        equ 0001h
ISRPR_ISRPR0_LENGTH                      equ 0001h
ISRPR_ISRPR0_MASK                        equ 0001h
ISRPR_ISRPR1_POSN                        equ 0001h
ISRPR_ISRPR1_POSITION                    equ 0001h
ISRPR_ISRPR1_SIZE                        equ 0001h
ISRPR_ISRPR1_LENGTH                      equ 0001h
ISRPR_ISRPR1_MASK                        equ 0002h
ISRPR_ISRPR2_POSN                        equ 0002h
ISRPR_ISRPR2_POSITION                    equ 0002h
ISRPR_ISRPR2_SIZE                        equ 0001h
ISRPR_ISRPR2_LENGTH                      equ 0001h
ISRPR_ISRPR2_MASK                        equ 0004h

// Register: MAINPR
#define MAINPR MAINPR
MAINPR                                   equ 039F2h
// bitfield definitions
MAINPR_PR_POSN                           equ 0000h
MAINPR_PR_POSITION                       equ 0000h
MAINPR_PR_SIZE                           equ 0003h
MAINPR_PR_LENGTH                         equ 0003h
MAINPR_PR_MASK                           equ 0007h
MAINPR_PR0_POSN                          equ 0000h
MAINPR_PR0_POSITION                      equ 0000h
MAINPR_PR0_SIZE                          equ 0001h
MAINPR_PR0_LENGTH                        equ 0001h
MAINPR_PR0_MASK                          equ 0001h
MAINPR_PR1_POSN                          equ 0001h
MAINPR_PR1_POSITION                      equ 0001h
MAINPR_PR1_SIZE                          equ 0001h
MAINPR_PR1_LENGTH                        equ 0001h
MAINPR_PR1_MASK                          equ 0002h
MAINPR_PR2_POSN                          equ 0002h
MAINPR_PR2_POSITION                      equ 0002h
MAINPR_PR2_SIZE                          equ 0001h
MAINPR_PR2_LENGTH                        equ 0001h
MAINPR_PR2_MASK                          equ 0004h
MAINPR_MAINPR_POSN                       equ 0000h
MAINPR_MAINPR_POSITION                   equ 0000h
MAINPR_MAINPR_SIZE                       equ 0003h
MAINPR_MAINPR_LENGTH                     equ 0003h
MAINPR_MAINPR_MASK                       equ 0007h
MAINPR_MAINPR0_POSN                      equ 0000h
MAINPR_MAINPR0_POSITION                  equ 0000h
MAINPR_MAINPR0_SIZE                      equ 0001h
MAINPR_MAINPR0_LENGTH                    equ 0001h
MAINPR_MAINPR0_MASK                      equ 0001h
MAINPR_MAINPR1_POSN                      equ 0001h
MAINPR_MAINPR1_POSITION                  equ 0001h
MAINPR_MAINPR1_SIZE                      equ 0001h
MAINPR_MAINPR1_LENGTH                    equ 0001h
MAINPR_MAINPR1_MASK                      equ 0002h
MAINPR_MAINPR2_POSN                      equ 0002h
MAINPR_MAINPR2_POSITION                  equ 0002h
MAINPR_MAINPR2_SIZE                      equ 0001h
MAINPR_MAINPR2_LENGTH                    equ 0001h
MAINPR_MAINPR2_MASK                      equ 0004h

