GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.inc
// Register: CCDPB
#define CCDPB CCDPB
CCDPB                                    equ 03A58h
// bitfield definitions
CCDPB_CCDPB0_POSN                        equ 0000h
CCDPB_CCDPB0_POSITION                    equ 0000h
CCDPB_CCDPB0_SIZE                        equ 0001h
CCDPB_CCDPB0_LENGTH                      equ 0001h
CCDPB_CCDPB0_MASK                        equ 0001h
CCDPB_CCDPB1_POSN                        equ 0001h
CCDPB_CCDPB1_POSITION                    equ 0001h
CCDPB_CCDPB1_SIZE                        equ 0001h
CCDPB_CCDPB1_LENGTH                      equ 0001h
CCDPB_CCDPB1_MASK                        equ 0002h
CCDPB_CCDPB2_POSN                        equ 0002h
CCDPB_CCDPB2_POSITION                    equ 0002h
CCDPB_CCDPB2_SIZE                        equ 0001h
CCDPB_CCDPB2_LENGTH                      equ 0001h
CCDPB_CCDPB2_MASK                        equ 0004h
CCDPB_CCDPB3_POSN                        equ 0003h
CCDPB_CCDPB3_POSITION                    equ 0003h
CCDPB_CCDPB3_SIZE                        equ 0001h
CCDPB_CCDPB3_LENGTH                      equ 0001h
CCDPB_CCDPB3_MASK                        equ 0008h
CCDPB_CCDPB4_POSN                        equ 0004h
CCDPB_CCDPB4_POSITION                    equ 0004h
CCDPB_CCDPB4_SIZE                        equ 0001h
CCDPB_CCDPB4_LENGTH                      equ 0001h
CCDPB_CCDPB4_MASK                        equ 0010h
CCDPB_CCDPB5_POSN                        equ 0005h
CCDPB_CCDPB5_POSITION                    equ 0005h
CCDPB_CCDPB5_SIZE                        equ 0001h
CCDPB_CCDPB5_LENGTH                      equ 0001h
CCDPB_CCDPB5_MASK                        equ 0020h
CCDPB_CCDPB6_POSN                        equ 0006h
CCDPB_CCDPB6_POSITION                    equ 0006h
CCDPB_CCDPB6_SIZE                        equ 0001h
CCDPB_CCDPB6_LENGTH                      equ 0001h
CCDPB_CCDPB6_MASK                        equ 0040h
CCDPB_CCDPB7_POSN                        equ 0007h
CCDPB_CCDPB7_POSITION                    equ 0007h
CCDPB_CCDPB7_SIZE                        equ 0001h
CCDPB_CCDPB7_LENGTH                      equ 0001h
CCDPB_CCDPB7_MASK                        equ 0080h

// Register: CCDNB
#define CCDNB CCDNB
CCDNB                                    equ 03A59h
// bitfield definitions
CCDNB_CCDNB0_POSN                        equ 0000h
CCDNB_CCDNB0_POSITION                    equ 0000h
CCDNB_CCDNB0_SIZE                        equ 0001h
CCDNB_CCDNB0_LENGTH                      equ 0001h
CCDNB_CCDNB0_MASK                        equ 0001h
CCDNB_CCDNB1_POSN                        equ 0001h
CCDNB_CCDNB1_POSITION                    equ 0001h
CCDNB_CCDNB1_SIZE                        equ 0001h
CCDNB_CCDNB1_LENGTH                      equ 0001h
CCDNB_CCDNB1_MASK                        equ 0002h
CCDNB_CCDNB2_POSN                        equ 0002h
CCDNB_CCDNB2_POSITION                    equ 0002h
CCDNB_CCDNB2_SIZE                        equ 0001h
CCDNB_CCDNB2_LENGTH                      equ 0001h
CCDNB_CCDNB2_MASK                        equ 0004h
CCDNB_CCDNB3_POSN                        equ 0003h
CCDNB_CCDNB3_POSITION                    equ 0003h
CCDNB_CCDNB3_SIZE                        equ 0001h
CCDNB_CCDNB3_LENGTH                      equ 0001h
CCDNB_CCDNB3_MASK                        equ 0008h
CCDNB_CCDNB4_POSN                        equ 0004h
CCDNB_CCDNB4_POSITION                    equ 0004h
CCDNB_CCDNB4_SIZE                        equ 0001h
CCDNB_CCDNB4_LENGTH                      equ 0001h
CCDNB_CCDNB4_MASK                        equ 0010h
CCDNB_CCDNB5_POSN                        equ 0005h
CCDNB_CCDNB5_POSITION                    equ 0005h
CCDNB_CCDNB5_SIZE                        equ 0001h
CCDNB_CCDNB5_LENGTH                      equ 0001h
CCDNB_CCDNB5_MASK                        equ 0020h
CCDNB_CCDNB6_POSN                        equ 0006h
CCDNB_CCDNB6_POSITION                    equ 0006h
CCDNB_CCDNB6_SIZE                        equ 0001h
CCDNB_CCDNB6_LENGTH                      equ 0001h
CCDNB_CCDNB6_MASK                        equ 0040h
CCDNB_CCDNB7_POSN                        equ 0007h
CCDNB_CCDNB7_POSITION                    equ 0007h
CCDNB_CCDNB7_SIZE                        equ 0001h
CCDNB_CCDNB7_LENGTH                      equ 0001h
CCDNB_CCDNB7_MASK                        equ 0080h

// Register: RB1I2C
#define RB1I2C RB1I2C
RB1I2C                                   equ 03A5Ah
// bitfield definitions
RB1I2C_TH_POSN                           equ 0000h
RB1I2C_TH_POSITION                       equ 0000h
RB1I2C_TH_SIZE                           equ 0002h
RB1I2C_TH_LENGTH                         equ 0002h
RB1I2C_TH_MASK                           equ 0003h
RB1I2C_PU_POSN                           equ 0004h
RB1I2C_PU_POSITION                       equ 0004h
RB1I2C_PU_SIZE                           equ 0002h
RB1I2C_PU_LENGTH                         equ 0002h
RB1I2C_PU_MASK                           equ 0030h
RB1I2C_SLEW_POSN                         equ 0006h
RB1I2C_SLEW_POSITION                     equ 0006h
RB1I2C_SLEW_SIZE                         equ 0001h
RB1I2C_SLEW_LENGTH                       equ 0001h
RB1I2C_SLEW_MASK                         equ 0040h
RB1I2C_TH0_POSN                          equ 0000h
RB1I2C_TH0_POSITION                      equ 0000h
RB1I2C_TH0_SIZE                          equ 0001h
RB1I2C_TH0_LENGTH                        equ 0001h
RB1I2C_TH0_MASK                          equ 0001h
RB1I2C_TH1_POSN                          equ 0001h
RB1I2C_TH1_POSITION                      equ 0001h
RB1I2C_TH1_SIZE                          equ 0001h
RB1I2C_TH1_LENGTH                        equ 0001h
RB1I2C_TH1_MASK                          equ 0002h
RB1I2C_PU0_POSN                          equ 0004h
RB1I2C_PU0_POSITION                      equ 0004h
RB1I2C_PU0_SIZE                          equ 0001h
RB1I2C_PU0_LENGTH                        equ 0001h
RB1I2C_PU0_MASK                          equ 0010h
RB1I2C_PU1_POSN                          equ 0005h
RB1I2C_PU1_POSITION                      equ 0005h
RB1I2C_PU1_SIZE                          equ 0001h
RB1I2C_PU1_LENGTH                        equ 0001h
RB1I2C_PU1_MASK                          equ 0020h
RB1I2C_I2CTH_POSN                        equ 0000h
RB1I2C_I2CTH_POSITION                    equ 0000h
RB1I2C_I2CTH_SIZE                        equ 0002h
RB1I2C_I2CTH_LENGTH                      equ 0002h
RB1I2C_I2CTH_MASK                        equ 0003h
RB1I2C_I2CPU_POSN                        equ 0004h
RB1I2C_I2CPU_POSITION                    equ 0004h
RB1I2C_I2CPU_SIZE                        equ 0002h
RB1I2C_I2CPU_LENGTH                      equ 0002h
RB1I2C_I2CPU_MASK                        equ 0030h
RB1I2C_I2CSLEW_POSN                      equ 0006h
RB1I2C_I2CSLEW_POSITION                  equ 0006h
RB1I2C_I2CSLEW_SIZE                      equ 0001h
RB1I2C_I2CSLEW_LENGTH                    equ 0001h
RB1I2C_I2CSLEW_MASK                      equ 0040h
RB1I2C_I2CTH0_POSN                       equ 0000h
RB1I2C_I2CTH0_POSITION                   equ 0000h
RB1I2C_I2CTH0_SIZE                       equ 0001h
RB1I2C_I2CTH0_LENGTH                     equ 0001h
RB1I2C_I2CTH0_MASK                       equ 0001h
RB1I2C_I2CTH1_POSN                       equ 0001h
RB1I2C_I2CTH1_POSITION                   equ 0001h
RB1I2C_I2CTH1_SIZE                       equ 0001h
RB1I2C_I2CTH1_LENGTH                     equ 0001h
RB1I2C_I2CTH1_MASK                       equ 0002h
RB1I2C_I2CPU0_POSN                       equ 0004h
RB1I2C_I2CPU0_POSITION                   equ 0004h
RB1I2C_I2CPU0_SIZE                       equ 0001h
RB1I2C_I2CPU0_LENGTH                     equ 0001h
RB1I2C_I2CPU0_MASK                       equ 0010h
RB1I2C_I2CPU1_POSN                       equ 0005h
RB1I2C_I2CPU1_POSITION                   equ 0005h
RB1I2C_I2CPU1_SIZE                       equ 0001h
RB1I2C_I2CPU1_LENGTH                     equ 0001h
RB1I2C_I2CPU1_MASK                       equ 0020h

// Register: RB2I2C
#define RB2I2C RB2I2C
RB2I2C                                   equ 03A5Bh
// bitfield definitions
RB2I2C_TH_POSN                           equ 0000h
RB2I2C_TH_POSITION                       equ 0000h
RB2I2C_TH_SIZE                           equ 0002h
RB2I2C_TH_LENGTH                         equ 0002h
RB2I2C_TH_MASK                           equ 0003h
RB2I2C_PU_POSN                           equ 0004h
RB2I2C_PU_POSITION                       equ 0004h
RB2I2C_PU_SIZE                           equ 0002h
RB2I2C_PU_LENGTH                         equ 0002h
RB2I2C_PU_MASK                           equ 0030h
RB2I2C_SLEW_POSN                         equ 0006h
RB2I2C_SLEW_POSITION                     equ 0006h
RB2I2C_SLEW_SIZE                         equ 0001h
RB2I2C_SLEW_LENGTH                       equ 0001h
RB2I2C_SLEW_MASK                         equ 0040h
RB2I2C_TH0_POSN                          equ 0000h
RB2I2C_TH0_POSITION                      equ 0000h
RB2I2C_TH0_SIZE                          equ 0001h
RB2I2C_TH0_LENGTH                        equ 0001h
RB2I2C_TH0_MASK                          equ 0001h
RB2I2C_TH1_POSN                          equ 0001h
RB2I2C_TH1_POSITION                      equ 0001h
RB2I2C_TH1_SIZE                          equ 0001h
RB2I2C_TH1_LENGTH                        equ 0001h
RB2I2C_TH1_MASK                          equ 0002h
RB2I2C_PU0_POSN                          equ 0004h
RB2I2C_PU0_POSITION                      equ 0004h
RB2I2C_PU0_SIZE                          equ 0001h
RB2I2C_PU0_LENGTH                        equ 0001h
RB2I2C_PU0_MASK                          equ 0010h
RB2I2C_PU1_POSN                          equ 0005h
RB2I2C_PU1_POSITION                      equ 0005h
RB2I2C_PU1_SIZE                          equ 0001h
RB2I2C_PU1_LENGTH                        equ 0001h
RB2I2C_PU1_MASK                          equ 0020h
RB2I2C_I2CTH_POSN                        equ 0000h
RB2I2C_I2CTH_POSITION                    equ 0000h
RB2I2C_I2CTH_SIZE                        equ 0002h
RB2I2C_I2CTH_LENGTH                      equ 0002h
RB2I2C_I2CTH_MASK                        equ 0003h
RB2I2C_I2CPU_POSN                        equ 0004h
RB2I2C_I2CPU_POSITION                    equ 0004h
RB2I2C_I2CPU_SIZE                        equ 0002h
RB2I2C_I2CPU_LENGTH                      equ 0002h
RB2I2C_I2CPU_MASK                        equ 0030h
RB2I2C_I2CSLEW_POSN                      equ 0006h
RB2I2C_I2CSLEW_POSITION                  equ 0006h
RB2I2C_I2CSLEW_SIZE                      equ 0001h
RB2I2C_I2CSLEW_LENGTH                    equ 0001h
RB2I2C_I2CSLEW_MASK                      equ 0040h
RB2I2C_I2CTH0_POSN                       equ 0000h
RB2I2C_I2CTH0_POSITION                   equ 0000h
RB2I2C_I2CTH0_SIZE                       equ 0001h
RB2I2C_I2CTH0_LENGTH                     equ 0001h
RB2I2C_I2CTH0_MASK                       equ 0001h
RB2I2C_I2CTH1_POSN                       equ 0001h
RB2I2C_I2CTH1_POSITION                   equ 0001h
RB2I2C_I2CTH1_SIZE                       equ 0001h
RB2I2C_I2CTH1_LENGTH                     equ 0001h
RB2I2C_I2CTH1_MASK                       equ 0002h
RB2I2C_I2CPU0_POSN                       equ 0004h
RB2I2C_I2CPU0_POSITION                   equ 0004h
RB2I2C_I2CPU0_SIZE                       equ 0001h
RB2I2C_I2CPU0_LENGTH                     equ 0001h
RB2I2C_I2CPU0_MASK                       equ 0010h
RB2I2C_I2CPU1_POSN                       equ 0005h
RB2I2C_I2CPU1_POSITION                   equ 0005h
RB2I2C_I2CPU1_SIZE                       equ 0001h
RB2I2C_I2CPU1_LENGTH                     equ 0001h
RB2I2C_I2CPU1_MASK                       equ 0020h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 03A60h
// bitfield definitions
ANSELC_ANSELC0_POSN                      equ 0000h
ANSELC_ANSELC0_POSITION                  equ 0000h
ANSELC_ANSELC0_SIZE                      equ 0001h
ANSELC_ANSELC0_LENGTH                    equ 0001h
ANSELC_ANSELC0_MASK                      equ 0001h
ANSELC_ANSELC1_POSN                      equ 0001h
ANSELC_ANSELC1_POSITION                  equ 0001h
ANSELC_ANSELC1_SIZE                      equ 0001h
ANSELC_ANSELC1_LENGTH                    equ 0001h
ANSELC_ANSELC1_MASK                      equ 0002h
ANSELC_ANSELC2_POSN                      equ 0002h
ANSELC_ANSELC2_POSITION                  equ 0002h
ANSELC_ANSELC2_SIZE                      equ 0001h
ANSELC_ANSELC2_LENGTH                    equ 0001h
ANSELC_ANSELC2_MASK                      equ 0004h
ANSELC_ANSELC3_POSN                      equ 0003h
ANSELC_ANSELC3_POSITION                  equ 0003h
ANSELC_ANSELC3_SIZE                      equ 0001h
ANSELC_ANSELC3_LENGTH                    equ 0001h
ANSELC_ANSELC3_MASK                      equ 0008h
ANSELC_ANSELC4_POSN                      equ 0004h
ANSELC_ANSELC4_POSITION                  equ 0004h
ANSELC_ANSELC4_SIZE                      equ 0001h
ANSELC_ANSELC4_LENGTH                    equ 0001h
ANSELC_ANSELC4_MASK                      equ 0010h
ANSELC_ANSELC5_POSN                      equ 0005h
ANSELC_ANSELC5_POSITION                  equ 0005h
ANSELC_ANSELC5_SIZE                      equ 0001h
ANSELC_ANSELC5_LENGTH                    equ 0001h
ANSELC_ANSELC5_MASK                      equ 0020h
ANSELC_ANSELC6_POSN                      equ 0006h
ANSELC_ANSELC6_POSITION                  equ 0006h
ANSELC_ANSELC6_SIZE                      equ 0001h
ANSELC_ANSELC6_LENGTH                    equ 0001h
ANSELC_ANSELC6_MASK                      equ 0040h
ANSELC_ANSELC7_POSN                      equ 0007h
ANSELC_ANSELC7_POSITION                  equ 0007h
ANSELC_ANSELC7_SIZE                      equ 0001h
ANSELC_ANSELC7_LENGTH                    equ 0001h
ANSELC_ANSELC7_MASK                      equ 0080h

