GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.inc
// Register: DMA2SSZH
#define DMA2SSZH DMA2SSZH
DMA2SSZH                                 equ 03BD8h
// bitfield definitions
DMA2SSZH_SSZ_POSN                        equ 0000h
DMA2SSZH_SSZ_POSITION                    equ 0000h
DMA2SSZH_SSZ_SIZE                        equ 0004h
DMA2SSZH_SSZ_LENGTH                      equ 0004h
DMA2SSZH_SSZ_MASK                        equ 000Fh
DMA2SSZH_DMA2SSZ_POSN                    equ 0000h
DMA2SSZH_DMA2SSZ_POSITION                equ 0000h
DMA2SSZH_DMA2SSZ_SIZE                    equ 0004h
DMA2SSZH_DMA2SSZ_LENGTH                  equ 0004h
DMA2SSZH_DMA2SSZ_MASK                    equ 000Fh
DMA2SSZH_SSZ8_POSN                       equ 0000h
DMA2SSZH_SSZ8_POSITION                   equ 0000h
DMA2SSZH_SSZ8_SIZE                       equ 0001h
DMA2SSZH_SSZ8_LENGTH                     equ 0001h
DMA2SSZH_SSZ8_MASK                       equ 0001h
DMA2SSZH_SSZ9_POSN                       equ 0001h
DMA2SSZH_SSZ9_POSITION                   equ 0001h
DMA2SSZH_SSZ9_SIZE                       equ 0001h
DMA2SSZH_SSZ9_LENGTH                     equ 0001h
DMA2SSZH_SSZ9_MASK                       equ 0002h
DMA2SSZH_SSZ10_POSN                      equ 0002h
DMA2SSZH_SSZ10_POSITION                  equ 0002h
DMA2SSZH_SSZ10_SIZE                      equ 0001h
DMA2SSZH_SSZ10_LENGTH                    equ 0001h
DMA2SSZH_SSZ10_MASK                      equ 0004h
DMA2SSZH_SSZ11_POSN                      equ 0003h
DMA2SSZH_SSZ11_POSITION                  equ 0003h
DMA2SSZH_SSZ11_SIZE                      equ 0001h
DMA2SSZH_SSZ11_LENGTH                    equ 0001h
DMA2SSZH_SSZ11_MASK                      equ 0008h
DMA2SSZH_DMA2SSZ8_POSN                   equ 0000h
DMA2SSZH_DMA2SSZ8_POSITION               equ 0000h
DMA2SSZH_DMA2SSZ8_SIZE                   equ 0001h
DMA2SSZH_DMA2SSZ8_LENGTH                 equ 0001h
DMA2SSZH_DMA2SSZ8_MASK                   equ 0001h
DMA2SSZH_DMA2SSZ9_POSN                   equ 0001h
DMA2SSZH_DMA2SSZ9_POSITION               equ 0001h
DMA2SSZH_DMA2SSZ9_SIZE                   equ 0001h
DMA2SSZH_DMA2SSZ9_LENGTH                 equ 0001h
DMA2SSZH_DMA2SSZ9_MASK                   equ 0002h
DMA2SSZH_DMA2SSZ10_POSN                  equ 0002h
DMA2SSZH_DMA2SSZ10_POSITION              equ 0002h
DMA2SSZH_DMA2SSZ10_SIZE                  equ 0001h
DMA2SSZH_DMA2SSZ10_LENGTH                equ 0001h
DMA2SSZH_DMA2SSZ10_MASK                  equ 0004h
DMA2SSZH_DMA2SSZ11_POSN                  equ 0003h
DMA2SSZH_DMA2SSZ11_POSITION              equ 0003h
DMA2SSZH_DMA2SSZ11_SIZE                  equ 0001h
DMA2SSZH_DMA2SSZ11_LENGTH                equ 0001h
DMA2SSZH_DMA2SSZ11_MASK                  equ 0008h

// Register: DMA2SSA
#define DMA2SSA DMA2SSA
DMA2SSA                                  equ 03BD9h

// Register: DMA2SSAL
#define DMA2SSAL DMA2SSAL
DMA2SSAL                                 equ 03BD9h
// bitfield definitions
DMA2SSAL_SSA_POSN                        equ 0000h
DMA2SSAL_SSA_POSITION                    equ 0000h
DMA2SSAL_SSA_SIZE                        equ 0008h
DMA2SSAL_SSA_LENGTH                      equ 0008h
DMA2SSAL_SSA_MASK                        equ 00FFh
DMA2SSAL_SSA0_POSN                       equ 0000h
DMA2SSAL_SSA0_POSITION                   equ 0000h
DMA2SSAL_SSA0_SIZE                       equ 0001h
DMA2SSAL_SSA0_LENGTH                     equ 0001h
DMA2SSAL_SSA0_MASK                       equ 0001h
DMA2SSAL_SSA1_POSN                       equ 0001h
DMA2SSAL_SSA1_POSITION                   equ 0001h
DMA2SSAL_SSA1_SIZE                       equ 0001h
DMA2SSAL_SSA1_LENGTH                     equ 0001h
DMA2SSAL_SSA1_MASK                       equ 0002h
DMA2SSAL_SSA2_POSN                       equ 0002h
DMA2SSAL_SSA2_POSITION                   equ 0002h
DMA2SSAL_SSA2_SIZE                       equ 0001h
DMA2SSAL_SSA2_LENGTH                     equ 0001h
DMA2SSAL_SSA2_MASK                       equ 0004h
DMA2SSAL_SSA3_POSN                       equ 0003h
DMA2SSAL_SSA3_POSITION                   equ 0003h
DMA2SSAL_SSA3_SIZE                       equ 0001h
DMA2SSAL_SSA3_LENGTH                     equ 0001h
DMA2SSAL_SSA3_MASK                       equ 0008h
DMA2SSAL_SSA4_POSN                       equ 0004h
DMA2SSAL_SSA4_POSITION                   equ 0004h
DMA2SSAL_SSA4_SIZE                       equ 0001h
DMA2SSAL_SSA4_LENGTH                     equ 0001h
DMA2SSAL_SSA4_MASK                       equ 0010h
DMA2SSAL_SSA5_POSN                       equ 0005h
DMA2SSAL_SSA5_POSITION                   equ 0005h
DMA2SSAL_SSA5_SIZE                       equ 0001h
DMA2SSAL_SSA5_LENGTH                     equ 0001h
DMA2SSAL_SSA5_MASK                       equ 0020h
DMA2SSAL_SSA6_POSN                       equ 0006h
DMA2SSAL_SSA6_POSITION                   equ 0006h
DMA2SSAL_SSA6_SIZE                       equ 0001h
DMA2SSAL_SSA6_LENGTH                     equ 0001h
DMA2SSAL_SSA6_MASK                       equ 0040h
DMA2SSAL_SSA7_POSN                       equ 0007h
DMA2SSAL_SSA7_POSITION                   equ 0007h
DMA2SSAL_SSA7_SIZE                       equ 0001h
DMA2SSAL_SSA7_LENGTH                     equ 0001h
DMA2SSAL_SSA7_MASK                       equ 0080h
DMA2SSAL_DMA2SSA_POSN                    equ 0000h
DMA2SSAL_DMA2SSA_POSITION                equ 0000h
DMA2SSAL_DMA2SSA_SIZE                    equ 0008h
DMA2SSAL_DMA2SSA_LENGTH                  equ 0008h
DMA2SSAL_DMA2SSA_MASK                    equ 00FFh
DMA2SSAL_DMA2SSA0_POSN                   equ 0000h
DMA2SSAL_DMA2SSA0_POSITION               equ 0000h
DMA2SSAL_DMA2SSA0_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA0_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA0_MASK                   equ 0001h
DMA2SSAL_DMA2SSA1_POSN                   equ 0001h
DMA2SSAL_DMA2SSA1_POSITION               equ 0001h
DMA2SSAL_DMA2SSA1_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA1_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA1_MASK                   equ 0002h
DMA2SSAL_DMA2SSA2_POSN                   equ 0002h
DMA2SSAL_DMA2SSA2_POSITION               equ 0002h
DMA2SSAL_DMA2SSA2_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA2_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA2_MASK                   equ 0004h
DMA2SSAL_DMA2SSA3_POSN                   equ 0003h
DMA2SSAL_DMA2SSA3_POSITION               equ 0003h
DMA2SSAL_DMA2SSA3_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA3_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA3_MASK                   equ 0008h
DMA2SSAL_DMA2SSA4_POSN                   equ 0004h
DMA2SSAL_DMA2SSA4_POSITION               equ 0004h
DMA2SSAL_DMA2SSA4_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA4_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA4_MASK                   equ 0010h
DMA2SSAL_DMA2SSA5_POSN                   equ 0005h
DMA2SSAL_DMA2SSA5_POSITION               equ 0005h
DMA2SSAL_DMA2SSA5_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA5_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA5_MASK                   equ 0020h
DMA2SSAL_DMA2SSA6_POSN                   equ 0006h
DMA2SSAL_DMA2SSA6_POSITION               equ 0006h
DMA2SSAL_DMA2SSA6_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA6_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA6_MASK                   equ 0040h
DMA2SSAL_DMA2SSA7_POSN                   equ 0007h
DMA2SSAL_DMA2SSA7_POSITION               equ 0007h
DMA2SSAL_DMA2SSA7_SIZE                   equ 0001h
DMA2SSAL_DMA2SSA7_LENGTH                 equ 0001h
DMA2SSAL_DMA2SSA7_MASK                   equ 0080h

// Register: DMA2SSAH
#define DMA2SSAH DMA2SSAH
DMA2SSAH                                 equ 03BDAh
// bitfield definitions
DMA2SSAH_SSA_POSN                        equ 0000h
DMA2SSAH_SSA_POSITION                    equ 0000h
DMA2SSAH_SSA_SIZE                        equ 0008h
DMA2SSAH_SSA_LENGTH                      equ 0008h
DMA2SSAH_SSA_MASK                        equ 00FFh
DMA2SSAH_SSA8_POSN                       equ 0000h
DMA2SSAH_SSA8_POSITION                   equ 0000h
DMA2SSAH_SSA8_SIZE                       equ 0001h
DMA2SSAH_SSA8_LENGTH                     equ 0001h
DMA2SSAH_SSA8_MASK                       equ 0001h
DMA2SSAH_SSA9_POSN                       equ 0001h
DMA2SSAH_SSA9_POSITION                   equ 0001h
DMA2SSAH_SSA9_SIZE                       equ 0001h
DMA2SSAH_SSA9_LENGTH                     equ 0001h
DMA2SSAH_SSA9_MASK                       equ 0002h
DMA2SSAH_SSA10_POSN                      equ 0002h
DMA2SSAH_SSA10_POSITION                  equ 0002h
DMA2SSAH_SSA10_SIZE                      equ 0001h
DMA2SSAH_SSA10_LENGTH                    equ 0001h
DMA2SSAH_SSA10_MASK                      equ 0004h
DMA2SSAH_SSA11_POSN                      equ 0003h
DMA2SSAH_SSA11_POSITION                  equ 0003h
DMA2SSAH_SSA11_SIZE                      equ 0001h
DMA2SSAH_SSA11_LENGTH                    equ 0001h
DMA2SSAH_SSA11_MASK                      equ 0008h
DMA2SSAH_SSA12_POSN                      equ 0004h
DMA2SSAH_SSA12_POSITION                  equ 0004h
DMA2SSAH_SSA12_SIZE                      equ 0001h
DMA2SSAH_SSA12_LENGTH                    equ 0001h
DMA2SSAH_SSA12_MASK                      equ 0010h
DMA2SSAH_SSA13_POSN                      equ 0005h
DMA2SSAH_SSA13_POSITION                  equ 0005h
DMA2SSAH_SSA13_SIZE                      equ 0001h
DMA2SSAH_SSA13_LENGTH                    equ 0001h
DMA2SSAH_SSA13_MASK                      equ 0020h
DMA2SSAH_SSA14_POSN                      equ 0006h
DMA2SSAH_SSA14_POSITION                  equ 0006h
DMA2SSAH_SSA14_SIZE                      equ 0001h
DMA2SSAH_SSA14_LENGTH                    equ 0001h
DMA2SSAH_SSA14_MASK                      equ 0040h
DMA2SSAH_SSA15_POSN                      equ 0007h
DMA2SSAH_SSA15_POSITION                  equ 0007h
DMA2SSAH_SSA15_SIZE                      equ 0001h
DMA2SSAH_SSA15_LENGTH                    equ 0001h
DMA2SSAH_SSA15_MASK                      equ 0080h
DMA2SSAH_DMA2SSA_POSN                    equ 0000h
DMA2SSAH_DMA2SSA_POSITION                equ 0000h
DMA2SSAH_DMA2SSA_SIZE                    equ 0008h
DMA2SSAH_DMA2SSA_LENGTH                  equ 0008h
DMA2SSAH_DMA2SSA_MASK                    equ 00FFh
DMA2SSAH_DMA2SSA8_POSN                   equ 0000h
DMA2SSAH_DMA2SSA8_POSITION               equ 0000h
DMA2SSAH_DMA2SSA8_SIZE                   equ 0001h
DMA2SSAH_DMA2SSA8_LENGTH                 equ 0001h
DMA2SSAH_DMA2SSA8_MASK                   equ 0001h
DMA2SSAH_DMA2SSA9_POSN                   equ 0001h
DMA2SSAH_DMA2SSA9_POSITION               equ 0001h
DMA2SSAH_DMA2SSA9_SIZE                   equ 0001h
DMA2SSAH_DMA2SSA9_LENGTH                 equ 0001h
DMA2SSAH_DMA2SSA9_MASK                   equ 0002h
DMA2SSAH_DMA2SSA10_POSN                  equ 0002h
DMA2SSAH_DMA2SSA10_POSITION              equ 0002h
DMA2SSAH_DMA2SSA10_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA10_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA10_MASK                  equ 0004h
DMA2SSAH_DMA2SSA11_POSN                  equ 0003h
DMA2SSAH_DMA2SSA11_POSITION              equ 0003h
DMA2SSAH_DMA2SSA11_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA11_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA11_MASK                  equ 0008h
DMA2SSAH_DMA2SSA12_POSN                  equ 0004h
DMA2SSAH_DMA2SSA12_POSITION              equ 0004h
DMA2SSAH_DMA2SSA12_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA12_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA12_MASK                  equ 0010h
DMA2SSAH_DMA2SSA13_POSN                  equ 0005h
DMA2SSAH_DMA2SSA13_POSITION              equ 0005h
DMA2SSAH_DMA2SSA13_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA13_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA13_MASK                  equ 0020h
DMA2SSAH_DMA2SSA14_POSN                  equ 0006h
DMA2SSAH_DMA2SSA14_POSITION              equ 0006h
DMA2SSAH_DMA2SSA14_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA14_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA14_MASK                  equ 0040h
DMA2SSAH_DMA2SSA15_POSN                  equ 0007h
DMA2SSAH_DMA2SSA15_POSITION              equ 0007h
DMA2SSAH_DMA2SSA15_SIZE                  equ 0001h
DMA2SSAH_DMA2SSA15_LENGTH                equ 0001h
DMA2SSAH_DMA2SSA15_MASK                  equ 0080h

// Register: DMA2SSAU
#define DMA2SSAU DMA2SSAU
DMA2SSAU                                 equ 03BDBh
// bitfield definitions
DMA2SSAU_SSA_POSN                        equ 0000h
DMA2SSAU_SSA_POSITION                    equ 0000h
DMA2SSAU_SSA_SIZE                        equ 0006h
DMA2SSAU_SSA_LENGTH                      equ 0006h
DMA2SSAU_SSA_MASK                        equ 003Fh
DMA2SSAU_SSA16_POSN                      equ 0000h
DMA2SSAU_SSA16_POSITION                  equ 0000h
DMA2SSAU_SSA16_SIZE                      equ 0001h
DMA2SSAU_SSA16_LENGTH                    equ 0001h
DMA2SSAU_SSA16_MASK                      equ 0001h
DMA2SSAU_SSA17_POSN                      equ 0001h
DMA2SSAU_SSA17_POSITION                  equ 0001h
DMA2SSAU_SSA17_SIZE                      equ 0001h
DMA2SSAU_SSA17_LENGTH                    equ 0001h
DMA2SSAU_SSA17_MASK                      equ 0002h
DMA2SSAU_SSA18_POSN                      equ 0002h
DMA2SSAU_SSA18_POSITION                  equ 0002h
DMA2SSAU_SSA18_SIZE                      equ 0001h
DMA2SSAU_SSA18_LENGTH                    equ 0001h
DMA2SSAU_SSA18_MASK                      equ 0004h
DMA2SSAU_SSA19_POSN                      equ 0003h
DMA2SSAU_SSA19_POSITION                  equ 0003h
DMA2SSAU_SSA19_SIZE                      equ 0001h
DMA2SSAU_SSA19_LENGTH                    equ 0001h
DMA2SSAU_SSA19_MASK                      equ 0008h
DMA2SSAU_SSA20_POSN                      equ 0004h
DMA2SSAU_SSA20_POSITION                  equ 0004h
DMA2SSAU_SSA20_SIZE                      equ 0001h
DMA2SSAU_SSA20_LENGTH                    equ 0001h
DMA2SSAU_SSA20_MASK                      equ 0010h
DMA2SSAU_SSA21_POSN                      equ 0005h
DMA2SSAU_SSA21_POSITION                  equ 0005h
DMA2SSAU_SSA21_SIZE                      equ 0001h
DMA2SSAU_SSA21_LENGTH                    equ 0001h
DMA2SSAU_SSA21_MASK                      equ 0020h
DMA2SSAU_DMA2SSA_POSN                    equ 0000h
DMA2SSAU_DMA2SSA_POSITION                equ 0000h
DMA2SSAU_DMA2SSA_SIZE                    equ 0006h
DMA2SSAU_DMA2SSA_LENGTH                  equ 0006h
DMA2SSAU_DMA2SSA_MASK                    equ 003Fh
DMA2SSAU_DMA2SSA16_POSN                  equ 0000h
DMA2SSAU_DMA2SSA16_POSITION              equ 0000h
DMA2SSAU_DMA2SSA16_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA16_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA16_MASK                  equ 0001h
DMA2SSAU_DMA2SSA17_POSN                  equ 0001h
DMA2SSAU_DMA2SSA17_POSITION              equ 0001h
DMA2SSAU_DMA2SSA17_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA17_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA17_MASK                  equ 0002h
DMA2SSAU_DMA2SSA18_POSN                  equ 0002h
DMA2SSAU_DMA2SSA18_POSITION              equ 0002h
DMA2SSAU_DMA2SSA18_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA18_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA18_MASK                  equ 0004h
DMA2SSAU_DMA2SSA19_POSN                  equ 0003h
DMA2SSAU_DMA2SSA19_POSITION              equ 0003h
DMA2SSAU_DMA2SSA19_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA19_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA19_MASK                  equ 0008h
DMA2SSAU_DMA2SSA20_POSN                  equ 0004h
DMA2SSAU_DMA2SSA20_POSITION              equ 0004h
DMA2SSAU_DMA2SSA20_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA20_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA20_MASK                  equ 0010h
DMA2SSAU_DMA2SSA21_POSN                  equ 0005h
DMA2SSAU_DMA2SSA21_POSITION              equ 0005h
DMA2SSAU_DMA2SSA21_SIZE                  equ 0001h
DMA2SSAU_DMA2SSA21_LENGTH                equ 0001h
DMA2SSAU_DMA2SSA21_MASK                  equ 0020h

