GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.inc
// Register: DMA1CON0
#define DMA1CON0 DMA1CON0
DMA1CON0                                 equ 03BFCh
// bitfield definitions
DMA1CON0_XIP_POSN                        equ 0000h
DMA1CON0_XIP_POSITION                    equ 0000h
DMA1CON0_XIP_SIZE                        equ 0001h
DMA1CON0_XIP_LENGTH                      equ 0001h
DMA1CON0_XIP_MASK                        equ 0001h
DMA1CON0_AIRQEN_POSN                     equ 0002h
DMA1CON0_AIRQEN_POSITION                 equ 0002h
DMA1CON0_AIRQEN_SIZE                     equ 0001h
DMA1CON0_AIRQEN_LENGTH                   equ 0001h
DMA1CON0_AIRQEN_MASK                     equ 0004h
DMA1CON0_DGO_POSN                        equ 0005h
DMA1CON0_DGO_POSITION                    equ 0005h
DMA1CON0_DGO_SIZE                        equ 0001h
DMA1CON0_DGO_LENGTH                      equ 0001h
DMA1CON0_DGO_MASK                        equ 0020h
DMA1CON0_SIRQEN_POSN                     equ 0006h
DMA1CON0_SIRQEN_POSITION                 equ 0006h
DMA1CON0_SIRQEN_SIZE                     equ 0001h
DMA1CON0_SIRQEN_LENGTH                   equ 0001h
DMA1CON0_SIRQEN_MASK                     equ 0040h
DMA1CON0_EN_POSN                         equ 0007h
DMA1CON0_EN_POSITION                     equ 0007h
DMA1CON0_EN_SIZE                         equ 0001h
DMA1CON0_EN_LENGTH                       equ 0001h
DMA1CON0_EN_MASK                         equ 0080h
DMA1CON0_DMA1XIP_POSN                    equ 0000h
DMA1CON0_DMA1XIP_POSITION                equ 0000h
DMA1CON0_DMA1XIP_SIZE                    equ 0001h
DMA1CON0_DMA1XIP_LENGTH                  equ 0001h
DMA1CON0_DMA1XIP_MASK                    equ 0001h
DMA1CON0_DMA1AIRQEN_POSN                 equ 0002h
DMA1CON0_DMA1AIRQEN_POSITION             equ 0002h
DMA1CON0_DMA1AIRQEN_SIZE                 equ 0001h
DMA1CON0_DMA1AIRQEN_LENGTH               equ 0001h
DMA1CON0_DMA1AIRQEN_MASK                 equ 0004h
DMA1CON0_DMA1DGO_POSN                    equ 0005h
DMA1CON0_DMA1DGO_POSITION                equ 0005h
DMA1CON0_DMA1DGO_SIZE                    equ 0001h
DMA1CON0_DMA1DGO_LENGTH                  equ 0001h
DMA1CON0_DMA1DGO_MASK                    equ 0020h
DMA1CON0_DMA1SIRQEN_POSN                 equ 0006h
DMA1CON0_DMA1SIRQEN_POSITION             equ 0006h
DMA1CON0_DMA1SIRQEN_SIZE                 equ 0001h
DMA1CON0_DMA1SIRQEN_LENGTH               equ 0001h
DMA1CON0_DMA1SIRQEN_MASK                 equ 0040h
DMA1CON0_DMA1EN_POSN                     equ 0007h
DMA1CON0_DMA1EN_POSITION                 equ 0007h
DMA1CON0_DMA1EN_SIZE                     equ 0001h
DMA1CON0_DMA1EN_LENGTH                   equ 0001h
DMA1CON0_DMA1EN_MASK                     equ 0080h

// Register: DMA1CON1
#define DMA1CON1 DMA1CON1
DMA1CON1                                 equ 03BFDh
// bitfield definitions
DMA1CON1_SSTP_POSN                       equ 0000h
DMA1CON1_SSTP_POSITION                   equ 0000h
DMA1CON1_SSTP_SIZE                       equ 0001h
DMA1CON1_SSTP_LENGTH                     equ 0001h
DMA1CON1_SSTP_MASK                       equ 0001h
DMA1CON1_SMODE_POSN                      equ 0001h
DMA1CON1_SMODE_POSITION                  equ 0001h
DMA1CON1_SMODE_SIZE                      equ 0002h
DMA1CON1_SMODE_LENGTH                    equ 0002h
DMA1CON1_SMODE_MASK                      equ 0006h
DMA1CON1_SMR_POSN                        equ 0003h
DMA1CON1_SMR_POSITION                    equ 0003h
DMA1CON1_SMR_SIZE                        equ 0002h
DMA1CON1_SMR_LENGTH                      equ 0002h
DMA1CON1_SMR_MASK                        equ 0018h
DMA1CON1_DSTP_POSN                       equ 0005h
DMA1CON1_DSTP_POSITION                   equ 0005h
DMA1CON1_DSTP_SIZE                       equ 0001h
DMA1CON1_DSTP_LENGTH                     equ 0001h
DMA1CON1_DSTP_MASK                       equ 0020h
DMA1CON1_DMODE_POSN                      equ 0006h
DMA1CON1_DMODE_POSITION                  equ 0006h
DMA1CON1_DMODE_SIZE                      equ 0002h
DMA1CON1_DMODE_LENGTH                    equ 0002h
DMA1CON1_DMODE_MASK                      equ 00C0h

// Register: DMA1AIRQ
#define DMA1AIRQ DMA1AIRQ
DMA1AIRQ                                 equ 03BFEh
// bitfield definitions
DMA1AIRQ_AIRQ_POSN                       equ 0000h
DMA1AIRQ_AIRQ_POSITION                   equ 0000h
DMA1AIRQ_AIRQ_SIZE                       equ 0008h
DMA1AIRQ_AIRQ_LENGTH                     equ 0008h
DMA1AIRQ_AIRQ_MASK                       equ 00FFh
DMA1AIRQ_DMA1AIRQ_POSN                   equ 0000h
DMA1AIRQ_DMA1AIRQ_POSITION               equ 0000h
DMA1AIRQ_DMA1AIRQ_SIZE                   equ 0008h
DMA1AIRQ_DMA1AIRQ_LENGTH                 equ 0008h
DMA1AIRQ_DMA1AIRQ_MASK                   equ 00FFh
DMA1AIRQ_AIRQ0_POSN                      equ 0000h
DMA1AIRQ_AIRQ0_POSITION                  equ 0000h
DMA1AIRQ_AIRQ0_SIZE                      equ 0001h
DMA1AIRQ_AIRQ0_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ0_MASK                      equ 0001h
DMA1AIRQ_AIRQ1_POSN                      equ 0001h
DMA1AIRQ_AIRQ1_POSITION                  equ 0001h
DMA1AIRQ_AIRQ1_SIZE                      equ 0001h
DMA1AIRQ_AIRQ1_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ1_MASK                      equ 0002h
DMA1AIRQ_AIRQ2_POSN                      equ 0002h
DMA1AIRQ_AIRQ2_POSITION                  equ 0002h
DMA1AIRQ_AIRQ2_SIZE                      equ 0001h
DMA1AIRQ_AIRQ2_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ2_MASK                      equ 0004h
DMA1AIRQ_AIRQ3_POSN                      equ 0003h
DMA1AIRQ_AIRQ3_POSITION                  equ 0003h
DMA1AIRQ_AIRQ3_SIZE                      equ 0001h
DMA1AIRQ_AIRQ3_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ3_MASK                      equ 0008h
DMA1AIRQ_AIRQ4_POSN                      equ 0004h
DMA1AIRQ_AIRQ4_POSITION                  equ 0004h
DMA1AIRQ_AIRQ4_SIZE                      equ 0001h
DMA1AIRQ_AIRQ4_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ4_MASK                      equ 0010h
DMA1AIRQ_AIRQ5_POSN                      equ 0005h
DMA1AIRQ_AIRQ5_POSITION                  equ 0005h
DMA1AIRQ_AIRQ5_SIZE                      equ 0001h
DMA1AIRQ_AIRQ5_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ5_MASK                      equ 0020h
DMA1AIRQ_AIRQ6_POSN                      equ 0006h
DMA1AIRQ_AIRQ6_POSITION                  equ 0006h
DMA1AIRQ_AIRQ6_SIZE                      equ 0001h
DMA1AIRQ_AIRQ6_LENGTH                    equ 0001h
DMA1AIRQ_AIRQ6_MASK                      equ 0040h
DMA1AIRQ_DMA1AIRQ0_POSN                  equ 0000h
DMA1AIRQ_DMA1AIRQ0_POSITION              equ 0000h
DMA1AIRQ_DMA1AIRQ0_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ0_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ0_MASK                  equ 0001h
DMA1AIRQ_DMA1AIRQ1_POSN                  equ 0001h
DMA1AIRQ_DMA1AIRQ1_POSITION              equ 0001h
DMA1AIRQ_DMA1AIRQ1_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ1_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ1_MASK                  equ 0002h
DMA1AIRQ_DMA1AIRQ2_POSN                  equ 0002h
DMA1AIRQ_DMA1AIRQ2_POSITION              equ 0002h
DMA1AIRQ_DMA1AIRQ2_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ2_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ2_MASK                  equ 0004h
DMA1AIRQ_DMA1AIRQ3_POSN                  equ 0003h
DMA1AIRQ_DMA1AIRQ3_POSITION              equ 0003h
DMA1AIRQ_DMA1AIRQ3_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ3_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ3_MASK                  equ 0008h
DMA1AIRQ_DMA1AIRQ4_POSN                  equ 0004h
DMA1AIRQ_DMA1AIRQ4_POSITION              equ 0004h
DMA1AIRQ_DMA1AIRQ4_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ4_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ4_MASK                  equ 0010h
DMA1AIRQ_DMA1AIRQ5_POSN                  equ 0005h
DMA1AIRQ_DMA1AIRQ5_POSITION              equ 0005h
DMA1AIRQ_DMA1AIRQ5_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ5_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ5_MASK                  equ 0020h
DMA1AIRQ_DMA1AIRQ6_POSN                  equ 0006h
DMA1AIRQ_DMA1AIRQ6_POSITION              equ 0006h
DMA1AIRQ_DMA1AIRQ6_SIZE                  equ 0001h
DMA1AIRQ_DMA1AIRQ6_LENGTH                equ 0001h
DMA1AIRQ_DMA1AIRQ6_MASK                  equ 0040h

// Register: DMA1SIRQ
#define DMA1SIRQ DMA1SIRQ
DMA1SIRQ                                 equ 03BFFh
// bitfield definitions
DMA1SIRQ_SIRQ_POSN                       equ 0000h
DMA1SIRQ_SIRQ_POSITION                   equ 0000h
DMA1SIRQ_SIRQ_SIZE                       equ 0008h
DMA1SIRQ_SIRQ_LENGTH                     equ 0008h
DMA1SIRQ_SIRQ_MASK                       equ 00FFh
DMA1SIRQ_DMA1SIRQ_POSN                   equ 0000h
DMA1SIRQ_DMA1SIRQ_POSITION               equ 0000h
DMA1SIRQ_DMA1SIRQ_SIZE                   equ 0008h
DMA1SIRQ_DMA1SIRQ_LENGTH                 equ 0008h
DMA1SIRQ_DMA1SIRQ_MASK                   equ 00FFh
DMA1SIRQ_SIRQ0_POSN                      equ 0000h
DMA1SIRQ_SIRQ0_POSITION                  equ 0000h
DMA1SIRQ_SIRQ0_SIZE                      equ 0001h
DMA1SIRQ_SIRQ0_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ0_MASK                      equ 0001h
DMA1SIRQ_SIRQ1_POSN                      equ 0001h
DMA1SIRQ_SIRQ1_POSITION                  equ 0001h
DMA1SIRQ_SIRQ1_SIZE                      equ 0001h
DMA1SIRQ_SIRQ1_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ1_MASK                      equ 0002h
DMA1SIRQ_SIRQ2_POSN                      equ 0002h
DMA1SIRQ_SIRQ2_POSITION                  equ 0002h
DMA1SIRQ_SIRQ2_SIZE                      equ 0001h
DMA1SIRQ_SIRQ2_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ2_MASK                      equ 0004h
DMA1SIRQ_SIRQ3_POSN                      equ 0003h
DMA1SIRQ_SIRQ3_POSITION                  equ 0003h
DMA1SIRQ_SIRQ3_SIZE                      equ 0001h
DMA1SIRQ_SIRQ3_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ3_MASK                      equ 0008h
DMA1SIRQ_SIRQ4_POSN                      equ 0004h
DMA1SIRQ_SIRQ4_POSITION                  equ 0004h
DMA1SIRQ_SIRQ4_SIZE                      equ 0001h
DMA1SIRQ_SIRQ4_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ4_MASK                      equ 0010h
DMA1SIRQ_SIRQ5_POSN                      equ 0005h
DMA1SIRQ_SIRQ5_POSITION                  equ 0005h
DMA1SIRQ_SIRQ5_SIZE                      equ 0001h
DMA1SIRQ_SIRQ5_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ5_MASK                      equ 0020h
DMA1SIRQ_SIRQ6_POSN                      equ 0006h
DMA1SIRQ_SIRQ6_POSITION                  equ 0006h
DMA1SIRQ_SIRQ6_SIZE                      equ 0001h
DMA1SIRQ_SIRQ6_LENGTH                    equ 0001h
DMA1SIRQ_SIRQ6_MASK                      equ 0040h
DMA1SIRQ_DMA1SIRQ0_POSN                  equ 0000h
DMA1SIRQ_DMA1SIRQ0_POSITION              equ 0000h
DMA1SIRQ_DMA1SIRQ0_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ0_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ0_MASK                  equ 0001h
DMA1SIRQ_DMA1SIRQ1_POSN                  equ 0001h
DMA1SIRQ_DMA1SIRQ1_POSITION              equ 0001h
DMA1SIRQ_DMA1SIRQ1_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ1_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ1_MASK                  equ 0002h
DMA1SIRQ_DMA1SIRQ2_POSN                  equ 0002h
DMA1SIRQ_DMA1SIRQ2_POSITION              equ 0002h
DMA1SIRQ_DMA1SIRQ2_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ2_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ2_MASK                  equ 0004h
DMA1SIRQ_DMA1SIRQ3_POSN                  equ 0003h
DMA1SIRQ_DMA1SIRQ3_POSITION              equ 0003h
DMA1SIRQ_DMA1SIRQ3_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ3_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ3_MASK                  equ 0008h
DMA1SIRQ_DMA1SIRQ4_POSN                  equ 0004h
DMA1SIRQ_DMA1SIRQ4_POSITION              equ 0004h
DMA1SIRQ_DMA1SIRQ4_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ4_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ4_MASK                  equ 0010h
DMA1SIRQ_DMA1SIRQ5_POSN                  equ 0005h
DMA1SIRQ_DMA1SIRQ5_POSITION              equ 0005h
DMA1SIRQ_DMA1SIRQ5_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ5_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ5_MASK                  equ 0020h
DMA1SIRQ_DMA1SIRQ6_POSN                  equ 0006h
DMA1SIRQ_DMA1SIRQ6_POSITION              equ 0006h
DMA1SIRQ_DMA1SIRQ6_SIZE                  equ 0001h
DMA1SIRQ_DMA1SIRQ6_LENGTH                equ 0001h
DMA1SIRQ_DMA1SIRQ6_MASK                  equ 0040h

// Register: CLC4CON
#define CLC4CON CLC4CON
CLC4CON                                  equ 03C56h
// bitfield definitions
CLC4CON_MODE_POSN                        equ 0000h
CLC4CON_MODE_POSITION                    equ 0000h
CLC4CON_MODE_SIZE                        equ 0003h
CLC4CON_MODE_LENGTH                      equ 0003h
CLC4CON_MODE_MASK                        equ 0007h
CLC4CON_INTN_POSN                        equ 0003h
CLC4CON_INTN_POSITION                    equ 0003h
CLC4CON_INTN_SIZE                        equ 0001h
CLC4CON_INTN_LENGTH                      equ 0001h
CLC4CON_INTN_MASK                        equ 0008h
CLC4CON_INTP_POSN                        equ 0004h
CLC4CON_INTP_POSITION                    equ 0004h
CLC4CON_INTP_SIZE                        equ 0001h
CLC4CON_INTP_LENGTH                      equ 0001h
CLC4CON_INTP_MASK                        equ 0010h
CLC4CON_OUT_POSN                         equ 0005h
CLC4CON_OUT_POSITION                     equ 0005h
CLC4CON_OUT_SIZE                         equ 0001h
CLC4CON_OUT_LENGTH                       equ 0001h
CLC4CON_OUT_MASK                         equ 0020h
CLC4CON_OE_POSN                          equ 0006h
CLC4CON_OE_POSITION                      equ 0006h
CLC4CON_OE_SIZE                          equ 0001h
CLC4CON_OE_LENGTH                        equ 0001h
CLC4CON_OE_MASK                          equ 0040h
CLC4CON_EN_POSN                          equ 0007h
CLC4CON_EN_POSITION                      equ 0007h
CLC4CON_EN_SIZE                          equ 0001h
CLC4CON_EN_LENGTH                        equ 0001h
CLC4CON_EN_MASK                          equ 0080h
CLC4CON_MODE0_POSN                       equ 0000h
CLC4CON_MODE0_POSITION                   equ 0000h
CLC4CON_MODE0_SIZE                       equ 0001h
CLC4CON_MODE0_LENGTH                     equ 0001h
CLC4CON_MODE0_MASK                       equ 0001h
CLC4CON_MODE1_POSN                       equ 0001h
CLC4CON_MODE1_POSITION                   equ 0001h
CLC4CON_MODE1_SIZE                       equ 0001h
CLC4CON_MODE1_LENGTH                     equ 0001h
CLC4CON_MODE1_MASK                       equ 0002h
CLC4CON_MODE2_POSN                       equ 0002h
CLC4CON_MODE2_POSITION                   equ 0002h
CLC4CON_MODE2_SIZE                       equ 0001h
CLC4CON_MODE2_LENGTH                     equ 0001h
CLC4CON_MODE2_MASK                       equ 0004h
CLC4CON_LC4MODE_POSN                     equ 0000h
CLC4CON_LC4MODE_POSITION                 equ 0000h
CLC4CON_LC4MODE_SIZE                     equ 0003h
CLC4CON_LC4MODE_LENGTH                   equ 0003h
CLC4CON_LC4MODE_MASK                     equ 0007h
CLC4CON_LC4INTN_POSN                     equ 0003h
CLC4CON_LC4INTN_POSITION                 equ 0003h
CLC4CON_LC4INTN_SIZE                     equ 0001h
CLC4CON_LC4INTN_LENGTH                   equ 0001h
CLC4CON_LC4INTN_MASK                     equ 0008h
CLC4CON_LC4INTP_POSN                     equ 0004h
CLC4CON_LC4INTP_POSITION                 equ 0004h
CLC4CON_LC4INTP_SIZE                     equ 0001h
CLC4CON_LC4INTP_LENGTH                   equ 0001h
CLC4CON_LC4INTP_MASK                     equ 0010h
CLC4CON_LC4OUT_POSN                      equ 0005h
CLC4CON_LC4OUT_POSITION                  equ 0005h
CLC4CON_LC4OUT_SIZE                      equ 0001h
CLC4CON_LC4OUT_LENGTH                    equ 0001h
CLC4CON_LC4OUT_MASK                      equ 0020h
CLC4CON_LC4OE_POSN                       equ 0006h
CLC4CON_LC4OE_POSITION                   equ 0006h
CLC4CON_LC4OE_SIZE                       equ 0001h
CLC4CON_LC4OE_LENGTH                     equ 0001h
CLC4CON_LC4OE_MASK                       equ 0040h
CLC4CON_LC4EN_POSN                       equ 0007h
CLC4CON_LC4EN_POSITION                   equ 0007h
CLC4CON_LC4EN_SIZE                       equ 0001h
CLC4CON_LC4EN_LENGTH                     equ 0001h
CLC4CON_LC4EN_MASK                       equ 0080h
CLC4CON_LC4MODE0_POSN                    equ 0000h
CLC4CON_LC4MODE0_POSITION                equ 0000h
CLC4CON_LC4MODE0_SIZE                    equ 0001h
CLC4CON_LC4MODE0_LENGTH                  equ 0001h
CLC4CON_LC4MODE0_MASK                    equ 0001h
CLC4CON_LC4MODE1_POSN                    equ 0001h
CLC4CON_LC4MODE1_POSITION                equ 0001h
CLC4CON_LC4MODE1_SIZE                    equ 0001h
CLC4CON_LC4MODE1_LENGTH                  equ 0001h
CLC4CON_LC4MODE1_MASK                    equ 0002h
CLC4CON_LC4MODE2_POSN                    equ 0002h
CLC4CON_LC4MODE2_POSITION                equ 0002h
CLC4CON_LC4MODE2_SIZE                    equ 0001h
CLC4CON_LC4MODE2_LENGTH                  equ 0001h
CLC4CON_LC4MODE2_MASK                    equ 0004h

// Register: CLC4POL
#define CLC4POL CLC4POL
CLC4POL                                  equ 03C57h
// bitfield definitions
CLC4POL_G1POL_POSN                       equ 0000h
CLC4POL_G1POL_POSITION                   equ 0000h
CLC4POL_G1POL_SIZE                       equ 0001h
CLC4POL_G1POL_LENGTH                     equ 0001h
CLC4POL_G1POL_MASK                       equ 0001h
CLC4POL_G2POL_POSN                       equ 0001h
CLC4POL_G2POL_POSITION                   equ 0001h
CLC4POL_G2POL_SIZE                       equ 0001h
CLC4POL_G2POL_LENGTH                     equ 0001h
CLC4POL_G2POL_MASK                       equ 0002h
CLC4POL_G3POL_POSN                       equ 0002h
CLC4POL_G3POL_POSITION                   equ 0002h
CLC4POL_G3POL_SIZE                       equ 0001h
CLC4POL_G3POL_LENGTH                     equ 0001h
CLC4POL_G3POL_MASK                       equ 0004h
CLC4POL_G4POL_POSN                       equ 0003h
CLC4POL_G4POL_POSITION                   equ 0003h
CLC4POL_G4POL_SIZE                       equ 0001h
CLC4POL_G4POL_LENGTH                     equ 0001h
CLC4POL_G4POL_MASK                       equ 0008h
CLC4POL_POL_POSN                         equ 0007h
CLC4POL_POL_POSITION                     equ 0007h
CLC4POL_POL_SIZE                         equ 0001h
CLC4POL_POL_LENGTH                       equ 0001h
CLC4POL_POL_MASK                         equ 0080h
CLC4POL_LC4G1POL_POSN                    equ 0000h
CLC4POL_LC4G1POL_POSITION                equ 0000h
CLC4POL_LC4G1POL_SIZE                    equ 0001h
CLC4POL_LC4G1POL_LENGTH                  equ 0001h
CLC4POL_LC4G1POL_MASK                    equ 0001h
CLC4POL_LC4G2POL_POSN                    equ 0001h
CLC4POL_LC4G2POL_POSITION                equ 0001h
CLC4POL_LC4G2POL_SIZE                    equ 0001h
CLC4POL_LC4G2POL_LENGTH                  equ 0001h
CLC4POL_LC4G2POL_MASK                    equ 0002h
CLC4POL_LC4G3POL_POSN                    equ 0002h
CLC4POL_LC4G3POL_POSITION                equ 0002h
CLC4POL_LC4G3POL_SIZE                    equ 0001h
CLC4POL_LC4G3POL_LENGTH                  equ 0001h
CLC4POL_LC4G3POL_MASK                    equ 0004h
CLC4POL_LC4G4POL_POSN                    equ 0003h
CLC4POL_LC4G4POL_POSITION                equ 0003h
CLC4POL_LC4G4POL_SIZE                    equ 0001h
CLC4POL_LC4G4POL_LENGTH                  equ 0001h
CLC4POL_LC4G4POL_MASK                    equ 0008h
CLC4POL_LC4POL_POSN                      equ 0007h
CLC4POL_LC4POL_POSITION                  equ 0007h
CLC4POL_LC4POL_SIZE                      equ 0001h
CLC4POL_LC4POL_LENGTH                    equ 0001h
CLC4POL_LC4POL_MASK                      equ 0080h

